//户籍
prototype1 = {
    dataCity: [

        {city: "北京东城区"}, {city: "北京西城区"}, {city: "北京崇文区"}, {city: "北京宣武区"}, {city: "北京朝阳区"}, {city: "北京海淀区"}, {city: "北京丰台区"}, {city: "北京石景山"},

        {city: "深圳罗湖"}, {city: "深圳福田"}, {city: "深圳南山"}, {city: "深圳盐田"}, {city: "深圳宝安"}, {city: "深圳龙岗"},

        {city: "上海宝山"}, {city: "上海金山"}, {city: "上海南市"}, {city: "上海长宁"}, {city: "上海静安"}, {city: "上海青浦"}, {city: "上海崇明"}, {city: "上海卢湾"}, {city: "上海松江"}, {city: "上海奉贤"}, {city: "上海浦东"}, {city: "上海杨浦"}, {city: "上海虹口"}, {city: "上海普陀"}, {city: "上海闸北"}, {city: "上海黄浦"}, {city: "上海闵行"}, {city: "上海徐汇"}, {city: "上海嘉定"}, {city: "上海南汇"},

        {city: "重庆渝中"}, {city: "重庆江北"}, {city: "重庆沙坪坝"}, {city: "重庆南岸"}, {city: "重庆九龙坡"}, {city: "重庆大渡口"},

        {city: "天津和平"}, {city: "天津河北"}, {city: "天津河西"}, {city: "天津河东"}, {city: "天津南开"}, {city: "天津红桥"}, {city: "天津塘沽"}, {city: "天津汉沽"}, {city: "天津大港"}, {city: "天津东丽"}, {city: "天津西青"}, {city: "天津津南"}, {city: "天津北辰"}, {city: "天津武清"}, {city: "天津滨海"},

        {city: "广东省广州"}, {city: "广东省珠海"}, {city: "广东省中山"}, {city: "广东省佛山"}, {city: "广东省东莞"}, {city: "广东省清远"}, {city: "广东省肇庆"}, {city: "广东省阳江"}, {city: "广东省湛江"}, {city: "广东省韶关"}, {city: "广东省惠州"}, {city: "广东省河源"}, {city: "广东省汕尾"}, {city: "广东省汕头"}, {city: "广东省梅州"},

        {city: "河北石家庄"}, {city: "河北唐山"}, {city: "河北秦皇岛"}, {city: "河北邯郸"}, {city: "河北邢台"}, {city: "河北张家口"}, {city: "河北承德"}, {city: "河北廊坊"}, {city: "河北沧州"}, {city: "河北保定"}, {city: "河北衡水"},

        {city: "山西太原"}, {city: "山西大同"}, {city: "山西阳泉"}, {city: "山西朔州"}, {city: "山西长治"}, {city: "山西临汾"}, {city: "山西晋城"},

        {city: "内蒙古呼和浩特"}, {city: "内蒙古包头"}, {city: "内蒙古乌海"}, {city: "内蒙古临河"}, {city: "内蒙古东胜"}, {city: "集宁"}, {city: "锡林浩特"}, {city: "内蒙古通辽"}, {city: "内蒙古赤峰"}, {city: "内蒙古海拉尔"}, {city: "内蒙古乌兰浩特"},

        {city: "辽宁沈阳"}, {city: "辽宁大连"}, {city: "辽宁鞍山"}, {city: "辽宁锦州"}, {city: "辽宁丹东"}, {city: "辽宁盘锦"}, {city: "辽宁铁岭"}, {city: "辽宁抚顺"}, {city: "辽宁营口"}, {city: "辽宁辽阳"}, {city: "辽宁阜新"}, {city: "辽宁本溪"}, {city: "辽宁朝阳"}, {city: "辽宁葫芦岛"},

        {city: "吉林长春"}, {city: "吉林吉林"}, {city: "吉林四平"}, {city: "吉林辽源"}, {city: "吉林通化"}, {city: "吉林白山"}, {city: "吉林松原"}, {city: "吉林白城"}, {city: "吉林延边"},

        {city: "黑龙江哈尔滨"}, {city: "黑龙江齐齐哈尔"}, {city: "黑龙江牡丹江"}, {city: "黑龙江佳木斯"}, {city: "黑龙江大庆"}, {city: "黑龙江伊春"}, {city: "黑龙江黑河"}, {city: "黑龙江鸡西"}, {city: "黑龙江鹤岗"}, {city: "黑龙江双鸭山"}, {city: "黑龙江七台河"}, {city: "黑龙江绥化"}, {city: "黑龙江大兴安岭"},

        {city: "江苏南京"}, {city: "江苏苏州"}, {city: "江苏无锡"}, {city: "江苏常州"}, {city: "江苏镇江"}, {city: "江苏连云港 "}, {city: "江苏扬州"}, {city: "江苏徐州 "}, {city: "江苏南通"}, {city: "江苏盐城"}, {city: "江苏淮阴"}, {city: "江苏泰州"}, {city: "江苏宿迁"},

        {city: "浙江杭州"}, {city: "浙江湖州"}, {city: "浙江丽水"}, {city: "浙江温州"}, {city: "浙江绍兴"}, {city: "浙江舟山"}, {city: "浙江嘉兴"}, {city: "浙江金华"}, {city: "浙江台州"}, {city: "浙江衢州"}, {city: "浙江宁波"},

        {city: "安徽合肥  "}, {city: "安徽芜湖 "}, {city: "安徽蚌埠 "}, {city: "安徽滁州 "}, {city: "安徽安庆 "}, {city: "安徽六安 "}, {city: "安徽黄山 "}, {city: "安徽宣城 "}, {city: "安徽淮南 "}, {city: "安徽宿州 "}, {city: "安徽马鞍山 "}, {city: "安徽铜陵"}, {city: "安徽淮北 "}, {city: "安徽阜阳 "}, {city: "安徽池州 "}, {city: "安徽巢湖 "}, {city: "安徽亳州"},

        {city: "福建福州 "}, {city: "福建厦门 "}, {city: "福建泉州 "}, {city: "福建漳州 "}, {city: "福建龙岩 "}, {city: "福建南平 "}, {city: "福建宁德 "}, {city: "福建莆田 "}, {city: "福建三明"},

        {city: "江西南昌"}, {city: "江西景德镇"}, {city: "江西九江"}, {city: "江西萍乡"}, {city: "江西新余"}, {city: "江西鹰潭"}, {city: "江西赣州"}, {city: "江西宜春"}, {city: "江西吉安"}, {city: "江西上饶"}, {city: "江西抚州"},

        {city: "山东济南"}, {city: "山东青岛"}, {city: "山东淄博"}, {city: "山东德州"}, {city: "山东烟台"}, {city: "山东潍坊"}, {city: "山东济宁"}, {city: "山东泰安"}, {city: "山东临沂"}, {city: "山东菏泽"}, {city: "山东威海"}, {city: "山东枣庄"}, {city: "山东日照"}, {city: "山东莱芜"}, {city: "山东聊城"}, {city: "山东滨州"}, {city: "山东东营"},

        {city: "河南郑州"}, {city: "河南开封"}, {city: "河南洛阳"}, {city: "河南平顶山"}, {city: "河南安阳"}, {city: "河南鹤壁"}, {city: "河南新乡"}, {city: "河南焦作"}, {city: "河南濮阳"}, {city: "河南许昌"}, {city: "河南漯河"}, {city: "河南三门峡"}, {city: "河南南阳"}, {city: "河南商丘"}, {city: "河南周口"}, {city: "河南驻马店"}, {city: "河南信阳"}, {city: "河南济源"},

        {city: "湖北武汉"}, {city: "湖北黄石"}, {city: "湖北十堰"}, {city: "湖北荆州"}, {city: "湖北宜昌"}, {city: "湖北襄樊"}, {city: "湖北鄂州"}, {city: "湖北荆门"}, {city: "湖北孝感"}, {city: "湖北黄冈"}, {city: "湖北咸宁"}, {city: "湖北恩施"}, {city: "湖北随州"}, {city: "湖北仙桃"}, {city: "湖北天门"}, {city: "湖北潜江"}, {city: "湖北神农架"},

        {city: "湖南长沙"}, {city: "湖南株州"}, {city: "湖南湘潭"}, {city: "湖南衡阳"}, {city: "湖南邵阳"}, {city: "湖南岳阳"}, {city: "湖南常德"}, {city: "湖南郴州"}, {city: "湖南益阳"}, {city: "湖南永州"}, {city: "湖南怀化"}, {city: "湖南娄底"}, {city: "湖南湘西"},

        {city: "广西南宁"}, {city: "广西柳州"}, {city: "广西桂林"}, {city: "广西梧州"}, {city: "广西北海"}, {city: "广西防城港"}, {city: "广西钦州"}, {city: "广西贵港"}, {city: "广西玉林"}, {city: "广西贺州"}, {city: "广西百色"}, {city: "广西河池"},

        {city: "海南海口 "}, {city: "海南三亚"}, {city: "海南通什"}, {city: "海南琼海"}, {city: "海南琼山"}, {city: "海南文昌"}, {city: "海南万宁"}, {city: "海南东方"}, {city: "海南儋州"},

        {city: "四川成都"}, {city: "四川自贡"}, {city: "四川攀枝花"}, {city: "四川泸州"}, {city: "四川德阳"}, {city: "四川绵阳"}, {city: "四川广元"}, {city: "四川遂宁"}, {city: "四川内江"}, {city: "四川乐山"}, {city: "四川南充  "}, {city: "四川宜宾"}, {city: "四川广安"}, {city: "四川达川"}, {city: "四川巴中"}, {city: "四川雅安"}, {city: "四川眉山  "}, {city: "四川阿坝 "}, {city: "四川甘孜 "}, {city: "四川凉山 "},

        {city: "贵州贵阳 "}, {city: "贵州六盘水"}, {city: "贵州遵义"}, {city: "贵州铜仁"}, {city: "贵州毕节"}, {city: "贵州安顺"}, {city: "贵州黔西南 "}, {city: "贵州黔东南"}, {city: "贵州黔南"},

        {city: "云南昆明"}, {city: "云南东川"}, {city: "云南曲靖"}, {city: "云南玉溪"}, {city: "云南昭通"}, {city: "云南思茅"}, {city: "云南临沧"}, {city: "云南保山"}, {city: "云南丽江"}, {city: "云南文山 "}, {city: "云南红河 "}, {city: "云南西双版纳 "}, {city: "云南楚雄 "}, {city: "云南大理 "}, {city: "云南德宏 "}, {city: "云南怒江"}, {city: "云南迪庆"},

        {city: "西藏拉萨"}, {city: "西藏那曲"}, {city: "西藏昌都"}, {city: "西藏山南"}, {city: "西藏日喀则"}, {city: "西藏阿里"}, {city: "西藏林芝"},

        {city: "陕西西安"}, {city: "陕西铜川"}, {city: "陕西宝鸡"}, {city: "陕西咸阳"}, {city: "陕西渭南"}, {city: "陕西延安"}, {city: "陕西汉中"}, {city: "陕西榆林"}, {city: "陕西商洛"}, {city: "陕西安康"},

        {city: "甘肃兰州"}, {city: "甘肃金昌"}, {city: "甘肃白银"}, {city: "甘肃天水"}, {city: "甘肃嘉峪关"}, {city: "甘肃定西"}, {city: "甘肃平凉"}, {city: "甘肃庆阳"}, {city: "甘肃陇南"}, {city: "甘肃武威"}, {city: "甘肃张掖"}, {city: "甘肃酒泉"}, {city: "甘肃甘南 "}, {city: "甘肃临夏"},

        {city: "青海西宁"}, {city: "青海海东"}, {city: "青海 海北 "}, {city: "青海黄南"}, {city: "青海海南"}, {city: "青海果洛"}, {city: "青海玉树"}, {city: "青海海西"},

        {city: "宁夏银川"}, {city: "宁夏石嘴山"}, {city: "宁夏银南"}, {city: "宁夏固原"},

        {city: "新疆乌鲁木齐"}, {city: "新疆克拉玛依"}, {city: "新疆石河子"}, {city: "新疆吐鲁番"}, {city: "新疆哈密"}, {city: "新疆和田"}, {city: "新疆阿克苏"}, {city: "新疆喀什"}, {city: "新疆克孜勒苏"}, {city: "新疆巴音郭楞"}, {city: "新疆昌吉"}, {city: "新疆博尔塔拉"}, {city: "新疆伊犁"},

        {city: "香港"},

        {city: "澳门"},

        {city: "台湾"}
    ]
};